; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=19, remove_proportion=0.2, bases=3, instance_id=8, output=./training, seed=49

(define (problem warehouse-08)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 - box
        base1 base2 base3 - base
    )
    (:init
        (to-remove box3)
        (to-remove box12)
        (to-remove box14)
        (clear box5)
        (on box5 box17)
        (on box17 box1)
        (on box1 box10)
        (on box10 box7)
        (on box7 box13)
        (on-base box13 base1)
        (clear box11)
        (on box11 box19)
        (on box19 box2)
        (on box2 box9)
        (on-base box9 base2)
        (clear box4)
        (on box4 box3)
        (on box3 box12)
        (on box12 box8)
        (on box8 box16)
        (on box16 box6)
        (on box6 box18)
        (on box18 box14)
        (on box14 box15)
        (on-base box15 base3)
    )
    (:goal (and 
        (removed box3)
        (removed box12)
        (removed box14)
    ))
)

; plan
1. (move box4 box3 box11)
   deleted: (clear box11) (on box4 box3)
   added: (on box4 box11) (clear box3)
   goals met: 0 of 3
2. (remove box3 box12)
   deleted: (on box3 box12) (clear box3)
   added: (removed box3) (clear box12)
   goals met: 1 of 3
3. (remove box12 box8)
   deleted: (on box12 box8) (clear box12)
   added: (removed box12) (clear box8)
   goals met: 2 of 3
4. (move box8 box16 box4)
   deleted: (clear box4) (on box8 box16)
   added: (on box8 box4) (clear box16)
   goals met: 2 of 3
5. (move box16 box6 box5)
   deleted: (clear box5) (on box16 box6)
   added: (on box16 box5) (clear box6)
   goals met: 2 of 3
6. (move box6 box18 box16)
   deleted: (clear box16) (on box6 box18)
   added: (on box6 box16) (clear box18)
   goals met: 2 of 3
7. (move box18 box14 box6)
   deleted: (clear box6) (on box18 box14)
   added: (on box18 box6) (clear box14)
   goals met: 2 of 3
8. (remove box14 box15)
   deleted: (on box14 box15) (clear box14)
   added: (removed box14) (clear box15)
   goals met: 3 of 3
